In [68]:
import pandas

In [69]:
import pandas as pd

In [70]:
df =pd.DataFrame()
type(df)

pandas.core.frame.DataFrame

In [71]:
df=pd.DataFrame([[12,'M',94],[43,'M',78],[56,'F',67],[45,'F',83],[12,'M',94]],index=['a','b','c','d','a'],columns=['age','gender','score'])

In [72]:
 df['gender']['b']='F'
df

C:\Users\FAHAD\AppData\Local\Temp\ipykernel_7548\177202885.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['gender']['b']='F'

   age gender  score
a   12      M     94
b   43      F     78
c   56      F     67
d   45      F     83
a   12      M     94

In [73]:
df.drop_duplicates()

   age gender  score
a   12      M     94
b   43      F     78
c   56      F     67
d   45      F     83

In [74]:
df[df.duplicated()]

   age gender  score
a   12      M     94

In [75]:
df[df['gender']=='F']

   age gender  score
b   43      F     78
c   56      F     67
d   45      F     83

In [76]:
df['gender']=='F'

a    False
b     True
c     True
d     True
a    False
Name: gender, dtype: bool

In [77]:
df[df['score']>90]

   age gender  score
a   12      M     94
a   12      M     94

In [78]:
 df[(df['score']>80) & (df['gender']=='F')]

   age gender  score
d   45      F     83

In [79]:
 df[(df['score']>80) & (df['gender']=='F')] ['score']

d    83
Name: score, dtype: int64

In [80]:
 df.to_csv('dataset.csv')

In [81]:
df_new=pd.read_csv('dataset.csv')

In [82]:
df_new=df_new.drop(['Unnamed: 0'],axis=1)

In [83]:
df_new

   age gender  score
0   12      M     94
1   43      F     78
2   56      F     67
3   45      F     83
4   12      M     94

In [84]:
def square(n): return n**2

In [85]:
square(9)

81

In [86]:
sqr = lambda n: n**2

In [87]:
sqr(4)

16

In [88]:
 df

   age gender  score
a   12      M     94
b   43      F     78
c   56      F     67
d   45      F     83
a   12      M     94

In [89]:
df['age'].apply(sqr)

a     144
b    1849
c    3136
d    2025
a     144
Name: age, dtype: int64

In [90]:
df['score'].apply(sqr)

a    8836
b    6084
c    4489
d    6889
a    8836
Name: score, dtype: int64

In [91]:
df['new_age']=df['age'].apply(sqr)

In [92]:
df

   age gender  score  new_age
a   12      M     94      144
b   43      F     78     1849
c   56      F     67     3136
d   45      F     83     2025
a   12      M     94      144

In [93]:
 df.sort_values(by='score')

   age gender  score  new_age
c   56      F     67     3136
b   43      F     78     1849
d   45      F     83     2025
a   12      M     94      144
a   12      M     94      144

In [94]:
 df.sort_values(by='score',ascending =False)

   age gender  score  new_age
a   12      M     94      144
a   12      M     94      144
d   45      F     83     2025
b   43      F     78     1849
c   56      F     67     3136

In [95]:
df.value_counts()

age  gender  score  new_age
12   M       94     144        2
43   F       78     1849       1
45   F       83     2025       1
56   F       67     3136       1
dtype: int64

In [96]:
df['gender'].value_counts()

F    3
M    2
Name: gender, dtype: int64

In [97]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, a to a
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   age      5 non-null      int64
 1   gender   5 non-null      object
 2   score    5 non-null      int64
 3   new_age  5 non-null      int64
dtypes: int64(3), object(1)
memory usage: 372.0+ bytes

In [98]:
df.describe()

             age     score      new_age
count   5.000000   5.00000     5.000000
mean   33.600000  83.20000  1459.600000
std    20.329781  11.43241  1298.386807
min    12.000000  67.00000   144.000000
25%    12.000000  78.00000   144.000000
50%    43.000000  83.00000  1849.000000
75%    45.000000  94.00000  2025.000000
max    56.000000  94.00000  3136.000000

In [99]:
df.corr()

              age     score   new_age
age      1.000000 -0.947214  0.989653
score   -0.947214  1.000000 -0.972006
new_age  0.989653 -0.972006  1.000000

In [100]:
df.head()

   age gender  score  new_age
a   12      M     94      144
b   43      F     78     1849
c   56      F     67     3136
d   45      F     83     2025
a   12      M     94      144

In [101]:
df.head(2)

   age gender  score  new_age
a   12      M     94      144
b   43      F     78     1849

In [102]:
df.tail(2)

   age gender  score  new_age
d   45      F     83     2025
a   12      M     94      144

In [103]:
df.columns

Index(['age', 'gender', 'score', 'new_age'], dtype='object')

In [104]:
df['score']['b']=

SyntaxError: invalid syntax (102293506.py, line 1)

In [105]:
df.to_csv('missing.csv')

In [106]:
df_1=pd.read_csv('missing.csv')

In [107]:
df_1

  Unnamed: 0  age gender  score  new_age
0          a   12      M     94      144
1          b   43      F     78     1849
2          c   56      F     67     3136
3          d   45      F     83     2025
4          a   12      M     94      144

In [108]:
import numpy as np
df_1['age'][1]=np.nan

C:\Users\FAHAD\AppData\Local\Temp\ipykernel_7548\1372634314.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_1['age'][1]=np.nan

In [109]:
df_1

  Unnamed: 0   age gender  score  new_age
0          a  12.0      M     94      144
1          b   NaN      F     78     1849
2          c  56.0      F     67     3136
3          d  45.0      F     83     2025
4          a  12.0      M     94      144

In [110]:
df_1['age']=df_1['age'].fillna(df_1['age'].median())
df_1

  Unnamed: 0   age gender  score  new_age
0          a  12.0      M     94      144
1          b  28.5      F     78     1849
2          c  56.0      F     67     3136
3          d  45.0      F     83     2025
4          a  12.0      M     94      144

In [111]:
df_1['new_age']=df_1['new_age'].fillna(df_1['new_age'].median())
df_1

  Unnamed: 0   age gender  score  new_age
0          a  12.0      M     94      144
1          b  28.5      F     78     1849
2          c  56.0      F     67     3136
3          d  45.0      F     83     2025
4          a  12.0      M     94      144

In [114]:
df_1

  Unnamed: 0   age gender  score  new_age
0          a  12.0      M     94      144
1          b  28.5      F     78     1849
2          c  56.0      F     67     3136
3          d  45.0      F     83     2025
4          a  12.0      M     94      144

In [115]:
df_1['gender'].mode()

0    F
Name: gender, dtype: object

In [116]:
df_1=pd.read_csv('missing.csv')
df_1

  Unnamed: 0  age gender   score  new_age
0          a   12     94   144.0      NaN
1          b   43      F  1849.0      NaN
2          c   56   3136     NaN      NaN
3          d   45      F    83.0      NaN
4          a   12      M   144.0      NaN

In [117]:
df_1=df_1.replace(np.nan,0)

In [118]:
df_1

  Unnamed: 0  age gender   score  new_age
0          a   12     94   144.0      0.0
1          b   43      F  1849.0      0.0
2          c   56   3136     0.0      0.0
3          d   45      F    83.0      0.0
4          a   12      M   144.0      0.0

In [4]:
df_2=df_1

NameError: name 'df_1' is not defined

In [121]:
df_1=pd.read_csv('missing.csv')
df_1.dropna()

Empty DataFrame
Columns: [Unnamed: 0, age, gender, score, new_age]
Index: []

In [9]:
print("Hello")

Hello

In [13]:
import pandas
import pandas as pd
df_2=pd.DataFrame([[12,'M',94],[43,'M',78],[56,'F',67],[45,'F',83],[12,'M',94]],index=['a','b','c','d','a'],columns=['age','gender','score'])

df_2

In [14]:
df_2

   age gender  score
a   12      M     94
b   43      M     78
c   56      F     67
d   45      F     83
a   12      M     94

In [15]:
df_2=df_2.dropna(thresh=2)

In [16]:
df_2

   age gender  score
a   12      M     94
b   43      M     78
c   56      F     67
d   45      F     83
a   12      M     94

In [17]:
df_2.shape[1]-1

2

In [19]:
df_2.shape

(5, 3)

In [20]:
df_2.shape[0]

5

In [27]:
import pandas as pd

df1=pd.DataFrame({
    'employee':['John','Anna','Mike'],
    'group':['Engiineering','HR','Sales']
})

df2=pd.DataFrame({
    'employee':['John','Anna','Mike'],
    'hire_date':[2004,2008,2012]
})

#merge based on employee column
merged_df=pd.merge(df1,df2,on='employee')
print(merged_df)

  employee         group  hire_date
0     John  Engiineering       2004
1     Anna            HR       2008
2     Mike         Sales       2012

In [25]:
merged_df

  employee         group  hire_date
0     John  Engiineering       2004
1     Anna            HR       2008
2     Mike         Sales       2012

In [29]:
import pandas as pd
df1=pd.DataFrame({
    'A':['A0','A1','A2'],
    'B':['B0','B1','B2']
},index=['K0','K1','K2'])

df2=pd.DataFrame({
    'C':['C0','C2','C3'],
    'D':['D0','D2','D3']
},index=['K0','K2','K3'])

#join in indices
joined_df=df1.join(df2)
print(joined_df)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [30]:
joined_df

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [31]:
import pandas as pd

df1=pd.DataFrame({
    'employee':['John','Anna','Mike'],
    'group':['Engiineering','HR','Sales']
})

df2=pd.DataFrame({
    'employee':['John','Anna','Mike'],
    'hire_date':[2004,2008,2012]
})

#merge based on employee column
append_df=df1.append(df2)
append_df

C:\Users\FAHAD\AppData\Local\Temp\ipykernel_10548\2834284773.py:14: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  append_df=df1.append(df2)

  employee         group  hire_date
0     John  Engiineering        NaN
1     Anna            HR        NaN
2     Mike         Sales        NaN
0     John           NaN     2004.0
1     Anna           NaN     2008.0
2     Mike           NaN     2012.0

In [33]:
DF2=df1.T

In [35]:
DF2

                     0     1      2
employee          John  Anna   Mike
group     Engiineering    HR  Sales